#ifndef LIBRARIES_H
#define LIBRARIES_H

#pragma once

//Библиотки работы с запросами SQL
//---------------------------------------------------------------------------------
#include <QSqlQuery>
#include <QSqlDatabase>
#include <QSqlTableModel>
#include <QSqlQueryModel>
//---------------------------------------------------------------------------------

//Библиотки таймера
//---------------------------------------------------------------------------------
#include <QTime>
#include <QTimer>
//---------------------------------------------------------------------------------

//Библиотки области отображения внутри главного окна
//---------------------------------------------------------------------------------
#include <QMdiArea>
//---------------------------------------------------------------------------------

//Библиотки вывода на печать
//---------------------------------------------------------------------------------
#include <QPrinter>
#include <QPrintDialog>
#include <QPainter>
#include <QPrintPreviewDialog>
#include <QPixmap>
//---------------------------------------------------------------------------------

//Библиотеки инструментов
//---------------------------------------------------------------------------------
#include <QTabBar>
#include <QLabel>
//---------------------------------------------------------------------------------

//Библиотеки отладки
//---------------------------------------------------------------------------------
#include <QDebug>
#include <QSqlError>
//---------------------------------------------------------------------------------

//Библиотеки объектов
//---------------------------------------------------------------------------------
#include <QStringList>
#include <QWidget>
#include <QDialog>
#include <QMessageBox>
//---------------------------------------------------------------------------------

#endif // LIBRARIES_H
